In [1]:
import numpy as np

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series(np.arange(3), index=['a','b','c'])

In [4]:
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int64

In [5]:
ser1['b']

2

In [7]:
ser1[2]

4

In [8]:
ser1[['a','b']]

a    0
b    2
dtype: int64

In [9]:
ser1[ser1>3]

c    4
dtype: int64

In [10]:
ser1[ser1>3] = 10

In [11]:
ser1

a     0
b     2
c    10
dtype: int64

In [13]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index=['LA', 'SF', 'NYC', 'DC', 'Denver'],
                  columns=['a','b','c','d','e'])

In [14]:
dframe['b']

LA         1
SF         6
NYC       11
DC        16
Denver    21
Name: b, dtype: int64

In [16]:
dframe

         a   b   c   d   e
LA       0   1   2   3   4
SF       5   6   7   8   9
NYC     10  11  12  13  14
DC      15  16  17  18  19
Denver  20  21  22  23  24

In [17]:
dframe[['b', 'e']]

         b   e
LA       1   4
SF       6   9
NYC     11  14
DC      16  19
Denver  21  24

In [18]:
dframe[dframe['c'] > 8]

         a   b   c   d   e
NYC     10  11  12  13  14
DC      15  16  17  18  19
Denver  20  21  22  23  24

In [19]:
dframe

         a   b   c   d   e
LA       0   1   2   3   4
SF       5   6   7   8   9
NYC     10  11  12  13  14
DC      15  16  17  18  19
Denver  20  21  22  23  24

In [20]:
dframe > 10

            a      b      c      d      e
LA      False  False  False  False  False
SF      False  False  False  False  False
NYC     False   True   True   True   True
DC       True   True   True   True   True
Denver   True   True   True   True   True

In [21]:
dframe.ix['LA']

a    0
b    1
c    2
d    3
e    4
Name: LA, dtype: int64

In [23]:
dframe.ix[0]

a    0
b    1
c    2
d    3
e    4
Name: LA, dtype: int64